nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW235B/iar/startup_MCXW235B.s
; -------------------------------------------------------------------------
;  @file:    startup_MCXW235B.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            MCXW235B
;  @version: 1.0
;  @date:    2022-3-8
;  @build:   b241118
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2024 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

__iar_init$$done:              ; The vector table is not needed
                      ; until after copy initialization is done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     0                                             ;Reserved
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     WDT_BOD_IRQHandler                            ;Windowed watchdog timer, Brownout detect, Flash interrupt
        DCD     DMA0_IRQHandler                               ;DMA0 controller
        DCD     GINT0_IRQHandler                              ;GPIO group 0
        DCD     Reserved19_IRQHandler                         ;Reserved interrupt
        DCD     PIN_INT0_IRQHandler                           ;Pin interrupt 0 or pattern match engine slice 0
        DCD     PIN_INT1_IRQHandler                           ;Pin interrupt 1or pattern match engine slice 1
        DCD     PIN_INT2_IRQHandler                           ;Pin interrupt 2 or pattern match engine slice 2
        DCD     PIN_INT3_IRQHandler                           ;Pin interrupt 3 or pattern match engine slice 3
        DCD     UTICK0_IRQHandler                             ;Micro-tick Timer
        DCD     MRT0_IRQHandler                               ;Multi-rate timer
        DCD     CTIMER0_IRQHandler                            ;Standard counter/timer CTIMER0
        DCD     CTIMER1_IRQHandler                            ;Standard counter/timer CTIMER1
        DCD     SCT0_IRQHandler                               ;SCTimer/PWM
        DCD     CTIMER3_IRQHandler                            ;Standard counter/timer CTIMER3
        DCD     FLEXCOMM0_IRQHandler                          ;Flexcomm Interface 0 (USART, SPI, I2C, FLEXCOMM)
        DCD     FLEXCOMM1_IRQHandler                          ;Flexcomm Interface 1 (USART, SPI, I2C, FLEXCOMM)
        DCD     FLEXCOMM2_IRQHandler                          ;Flexcomm Interface 2 (USART, SPI, I2C, FLEXCOMM)
        DCD     Reserved33_IRQHandler                         ;Reserved interrupt
        DCD     Reserved34_IRQHandler                         ;Reserved interrupt
        DCD     Reserved35_IRQHandler                         ;Reserved interrupt
        DCD     Reserved36_IRQHandler                         ;Reserved interrupt
        DCD     Reserved37_IRQHandler                         ;Reserved interrupt
        DCD     BLE_LL_IRQHandler                             ;BLE Link Layer interrupt
        DCD     BLE_SLP_TMR_IRQHandler                        ;BLE Sleep Timer interrupt
        DCD     WDT_IRQHandler                                ;Windowed Watchdog interrupt
        DCD     Reserved41_IRQHandler                         ;Reserved interrupt
        DCD     Reserved42_IRQHandler                         ;Reserved interrupt
        DCD     BOD1_IRQHandler                               ;Brown-out detector 1 interrupt
        DCD     BOD2_IRQHandler                               ;Brown-out detector 2 interrupt
        DCD     RTC_IRQHandler                                ;RTC alarm and wake-up interrupts
        DCD     Reserved46_IRQHandler                         ;Reserved interrupt
        DCD     WAKE_DSLP_IRQHandler                          ;Wakeup from deepsleep interrupt
        DCD     PIN_INT4_IRQHandler                           ;Pin interrupt 4 or pattern match engine slice 4 int
        DCD     PIN_INT5_IRQHandler                           ;Pin interrupt 5 or pattern match engine slice 5 int
        DCD     PIN_INT6_IRQHandler                           ;Pin interrupt 6 or pattern match engine slice 6 int
        DCD     PIN_INT7_IRQHandler                           ;Pin interrupt 7 or pattern match engine slice 7 int
        DCD     CTIMER2_IRQHandler                            ;Standard counter/timer CTIMER2
        DCD     CTIMER4_IRQHandler                            ;Standard counter/timer CTIMER4
        DCD     OS_EVENT_IRQHandler                           ;OS_EVENT_TIMER and OS_EVENT_WAKEUP interrupts
        DCD     SPIFI_IRQHandler                              ;QuadSPI Flash interface interrupt
        DCD     Reserved56_IRQHandler                         ;Reserved interrupt
        DCD     Reserved57_IRQHandler                         ;Reserved interrupt
        DCD     Reserved58_IRQHandler                         ;Reserved interrupt
        DCD     FLASH_CCIF_IRQHandler                         ;Flash command complete interrupt
        DCD     FLASH_DFIF_IRQHandler                         ;Flash ECC double-bit error detect interrupt
        DCD     Reserved61_IRQHandler                         ;Reserved interrupt
        DCD     Reserved62_IRQHandler                         ;Reserved interrupt
        DCD     Reserved63_IRQHandler                         ;Reserved interrupt
        DCD     Reserved64_IRQHandler                         ;Reserved interrupt
        DCD     SEC_HYPERVISOR_CALL_IRQHandler                ;SEC_HYPERVISOR_CALL interrupt
        DCD     SEC_GPIO_INT0_IRQ0_IRQHandler                 ;SEC_GPIO_INT0_IRQ0 interrupt
        DCD     SEC_GPIO_INT0_IRQ1_IRQHandler                 ;SEC_GPIO_INT0_IRQ1 interrupt
        DCD     PLU_IRQHandler                                ;PLU interrupt
        DCD     SEC_VIO_IRQHandler                            ;SEC_VIO interrupt
        DCD     HASHCRYPT_IRQHandler                          ;SHA interrupt
        DCD     CASPER_IRQHandler                             ;CASPER interrupt
        DCD     PUF_IRQHandler                                ;PUF interrupt
        DCD     TRNG_IRQHandler                               ;TRNG interrupt
        DCD     DMA1_IRQHandler                               ;DMA1 interrupt
        DCD     Reserved75_IRQHandler                         ;Reserved interrupt
        DCD     CDOG_IRQHandler                               ;CDOG interrupt
        DCD     Reserved77_IRQHandler                         ;Reserved interrupt
        DCD     Reserved78_IRQHandler                         ;Reserved interrupt
        DCD     WAKE_PAD_IRQHandler                           ;Wakeup from pin interrupt
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

